Show / Hide Table of Contents
Enum WeldType
Represents the code of the position
Namespace: IdeaRS.OpenModel.Parameters
Assembly: IdeaRS.OpenModel.dll
Syntax
public enum WeldType
Fields
 Name |  Description
 Bevel
Bevel weld
 DoubleFillet
Fillet weld on both sides (double fillet)
 LeftFillet
Fillet weld is on the left side
 None
No weld
 RightFillet
Fillet weld on the right side
 Improve this Doc
 View Source